---
tip: translate by openai@2023-06-24 10:43:53
...
---
description: Symbols (Debugging with GDB)
distribution: global
Generator: makeinfo
keywords: Symbols (Debugging with GDB)
lang: en
resource-type: document
title: Symbols (Debugging with GDB)
---
::: header
Next: [Altering](Altering.html#Altering)]
:::

---

## 16 Examining the Symbol Table


The commands described in this chapter allow you to inquire about the symbols (names of variables, functions and types) defined in your program. This information is inherent in the text of your program and does not change as your program executes. [GDB] (see [Choosing Files](File-Options.html#File-Options)), or by one of the file-management commands (see [Commands to Specify Files](Files.html#Files)).

> 本章节中描述的命令允许您查询程序中定义的符号（变量、函数和类型的名称）。此信息固有于您的程序文本中，在程序执行过程中不会改变（参见[选择文件](File-Options.html#File-Options)，或者使用文件管理命令（参见[指定文件命令](Files.html#Files)））。


Occasionally, you may need to refer to symbols that contain unusual characters, which [GDB]' as a single symbol, enclose it in single quotes; for example,

> 偶尔，您可能需要引用包含不寻常字符的符号，将[GDB]作为单个符号，用单引号括起来；例如，'。

::: smallexample

```bash
p 'foo.c'::x
```

:::

looks up the value of `x` in the scope of the file `foo.c`.

`set case-sensitive on`

`set case-sensitive off`

`set case-sensitive auto`



> 如果`arg`是一个表达式（参见[表达式](Expressions.html#Expressions)），它并不会被实际计算，其中的任何有副作用的操作（例如赋值或函数调用）都不会发生。


If `arg` is a variable or an expression, `whatis` prints its literal type as it is used in the source code. If the type was defined using a `typedef`, `whatis` will *not* print the data type underlying the `typedef`. If the type of the variable or the expression is a compound data type, such as `struct` or `class`, `whatis` never prints their fields or methods. It just prints the `struct`/`class` name (a.k.a. its *tag*). If you want to see the members of such a compound data type, use `ptype`.

> 如果`arg`是一个变量或表达式，`whatis`会打印出它在源代码中使用的原始类型。如果类型是使用`typedef`定义的，`whatis`*不会*打印底层的数据类型。如果变量或表达式的类型是复合数据类型，比如`struct`或`class`，`whatis`永远不会打印它们的字段或方法。它只会打印`struct`/`class`的名字（又称其标签）。如果你想查看这种复合数据类型的成员，请使用`ptype`。


If `arg`. However, if that underlying type is also a `typedef`, `whatis` will not unroll it.

> 如果`arg`是一个底层类型，`whatis`将不会展开它，但如果它也是一个`typedef`，`whatis`不会展开它。

For C code, the type names may also have the form '`class class-name`'.

`flags` can be used to modify how the type is displayed. Available flags are:

`r`


:   Display in "raw" form. Normally, [GDB] substitutes template parameters and typedefs defined in a class when printing the class' members. The `/r` flag disables this.

> 显示"原始"形式。通常情况下，[GDB]在打印类成员时会替换类中定义的模板参数和typedefs。 `/r`标志禁用此功能。

`m`

:   Do not print methods defined in the class.

`M`


:   Print methods defined in the class. This is the default, but the flag exists in case you change the default with `set print type methods`.

> 打印类中定义的方法。这是默认值，但是如果你使用`set print type methods`更改了默认值，则存在标志。

`t`


:   Do not print typedefs defined in the class. Note that this controls whether the typedef definition itself is printed, not whether typedef names are substituted when printing other types.

> 不要打印类中定义的typedef。注意，这控制了打印typedef定义本身，而不是打印其他类型时是否替换typedef名称。

`T`


:   Print typedefs defined in the class. This is the default, but the flag exists in case you change the default with `set print type typedefs`.

> 打印类中定义的类型定义。这是默认值，但是可以通过`set print type typedefs`更改默认值。

`o`


:   Print the offsets and sizes of fields in a struct, similar to what the `pahole` tool does. This option implies the `/tm` flags.

> 打印结构体中字段的偏移量和大小，类似于`pahole`工具所做的。此选项包含`/tm`标志。

`x`


:   Use hexadecimal notation when printing offsets and sizes of fields in a struct.

> 使用十六进制标记打印结构体中的偏移量和字段大小。

`d`


:   Use decimal notation when printing offsets and sizes of fields in a struct.

> 使用十进制表示法打印结构体中的偏移量和字段大小。

```
For example, given the following declarations:

::: smallexample
``` smallexample
struct tuv
{
  int a1;
  char *a2;
  int a3;
};

struct xyz
{
  int f1;
  char f2;
  void *f3;
  struct tuv f4;
};

union qwe
{
  struct tuv fff1;
  struct xyz fff2;
};

struct tyu
{
  int a1 : 1;
  int a2 : 3;
  int a3 : 23;
  char a4 : 2;
  int64_t a5;
  int a6 : 5;
  int64_t a7 : 3;
};
```

:::

Issuing a [ptype /o struct tuv] command would print:

::: smallexample

```bash
(gdb) ptype /o struct tuv
/* offset      |    size */  type = struct tuv {
/*      0      |       4 */    int a1;
/* XXX  4-byte hole      */
/*      8      |       8 */    char *a2;
/*     16      |       4 */    int a3;

                               /* total size (bytes):   24 */
                             }
```

:::

Notice the format of the first column of comments. There, you can find two parts separated by the '`|`' character: the *offset*, which indicates where the field is located inside the struct, in bytes, and the *size* of the field. Another interesting line is the marker of a *hole* in the struct, indicating that it may be possible to pack the struct and make it use less space by reorganizing its fields.

It is also possible to print offsets inside an union:

::: smallexample

```bash
(gdb) ptype /o union qwe
/* offset      |    size */  type = union qwe {
/*                    24 */    struct tuv {
/*      0      |       4 */        int a1;
/* XXX  4-byte hole      */
/*      8      |       8 */        char *a2;
/*     16      |       4 */        int a3;

                                   /* total size (bytes):   24 */
                               } fff1;
/*                    40 */    struct xyz {
/*      0      |       4 */        int f1;
/*      4      |       1 */        char f2;
/* XXX  3-byte hole      */
/*      8      |       8 */        void *f3;
/*     16      |      24 */        struct tuv {
/*     16      |       4 */            int a1;
/* XXX  4-byte hole      */
/*     24      |       8 */            char *a2;
/*     32      |       4 */            int a3;

                                       /* total size (bytes):   24 */
                                   } f4;

                                   /* total size (bytes):   40 */
                               } fff2;

                               /* total size (bytes):   40 */
                             }
```

:::

In this case, since `struct tuv` and `struct xyz` occupy the same space (because we are dealing with an union), the offset is not printed for them. However, you can still examine the offset of each of these structures' fields.

Another useful scenario is printing the offsets of a struct containing bitfields:

::: smallexample

```bash
(gdb) ptype /o struct tyu
/* offset      |    size */  type = struct tyu {
/*      0:31   |       4 */    int a1 : 1;
/*      0:28   |       4 */    int a2 : 3;
/*      0: 5   |       4 */    int a3 : 23;
/*      3: 3   |       1 */    signed char a4 : 2;
/* XXX  3-bit hole       */
/* XXX  4-byte hole      */
/*      8      |       8 */    int64_t a5;
/*     16: 0   |       4 */    int a6 : 5;
/*     16: 5   |       8 */    int64_t a7 : 3;
/* XXX  7-byte padding   */

                               /* total size (bytes):   24 */
                             }
```

:::

Note how the offset information is now extended to also include the first bit of the bitfield.

```



`ptype[/flags] [arg]`

`ptype` accepts the same arguments as `whatis`, but prints a detailed description of the type, instead of just the name of the type. See [Expressions](Expressions.html#Expressions).


Contrary to `whatis`, `ptype` always unrolls any `typedef` s in its argument declaration, whether the argument is a variable, expression, or a data type. This means that `ptype` of a variable or an expression will not print literally its type as present in the source code---use `whatis` for that. `typedef` s at the pointer or reference targets are also unrolled. Only `typedef` s of fields, methods and inner `class typedef` s of `struct` s, `class` es and `union` s are not unrolled even with `ptype`.

